tap "homebrew/bundle"
tap "homebrew/services"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# General-purpose data compression with high compression ratio
brew "xz"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Core application library for C
brew "glib"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# New GNU portable threads library
brew "npth"
brew "gpg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the pico text editor
brew "nano"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compression/decompression library aiming for high speed
brew "snappy"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Screen colour temperature controller
cask "flux"
cask "font-consolas-for-powerline"
cask "font-fira-code"
# Terminal built on web technologies
cask "hyper"
# Keyboard customiser
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
cask "lastpass"
# Support for Logitech
cask "logitech-options"
# Clipboard manager
cask "maccy"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Other software
cask "spotify"
cask "jabra-direct"
cask "loom"
cask "lastpass"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "alexdima.copy-relative-path"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "sobolevn.pustota"
vscode "teabyii.ayu"
