tap "dorukgezici/cask"
tap "gigalixir/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Bourne-Again SHell, a UNIX command interpreter
brew "asdf"
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Insanely fast image printing in your terminal
brew "catimg"
# Mozilla CA bundle for Python
brew "certifi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# General-purpose data compression with high compression ratio
brew "xz"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "gigalixir"
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Statically typed language for the Erlang VM
brew "gleam"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Core application library for C
brew "glib"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# New GNU portable threads library
brew "npth"
brew "gpg"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Command-line hex viewer
brew "hexyl"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
brew "ilmbase"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "libtool"
brew "little-cms2"
brew "openexr"
brew "openjpeg"
brew "jpegoptim"
brew "jq"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
brew "nano"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
brew "optipng"
brew "pandoc"
brew "pgcli"
brew "php"
brew "pinentry-mac"
brew "postgresql@12"
brew "pyenv"
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compression/decompression library aiming for high speed
brew "snappy"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
brew "yarn"
brew "z"
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
brew "getantibody/tap/antibody"
cask "brave-browser"
cask "discord"
cask "docker"
# App to build and share containerised applications and microservices
cask "docker"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Web browser
cask "firefox"
cask "firefox-developer-edition"
cask "fliqlo"
cask "flux"
cask "font-consolas-for-powerline"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
cask "jabra-direct"
# Keyboard customiser
cask "karabiner-elements"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
cask "lastpass"
cask "logitech-options"
cask "loom"
# Support for Logitech G gear
cask "logitech-g-hub"
# Clipboard manager
cask "maccy"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sequel-pro"
cask "skype"
cask "spectacle"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zoomus"
mas "Jira Cloud by Atlassian", id: 1475897096
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "alexdima.copy-relative-path"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "sobolevn.pustota"
vscode "teabyii.ayu"
